{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f1ed3efe",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "0c07111c",
   "metadata": {},
   "outputs": [],
   "source": [
    "sucess = load_dotenv(\".venv/.env\", override=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "d1a133c8",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_uri = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USER\")\n",
    "neo4j_password = os.getenv(\"NEO4J_PASSWORD\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8f513faa",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "from langchain_core.documents import Document\n",
    "from langchain_ollama import ChatOllama"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "33c2f51a",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatOllama(temperature=0, model=\"gemma3:12b\")\n",
    "graph_transformer = LLMGraphTransformer(\n",
    "    llm=llm, \n",
    "    node_properties=[\"name\", \"type\", \"canonical_name\"]\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "fbdf7370",
   "metadata": {},
   "outputs": [],
   "source": [
    "text = \"\"\"\n",
    "Albert Einstein pronunciación en alemán: /ˈalbɐt ˈaɪnʃtaɪn/ (escucharⓘ);[2]​ (Ulm, Imperio alemán, 14 de marzo de 1879-Princeton, Estados Unidos, 18 de abril de 1955) fue un físico alemán de origen judío, nacionalizado después suizo, austriaco y estadounidense. Se le considera el científico más importante, conocido y popular del siglo XX.[3]​[4]​\n",
    "\n",
    "En 1905, cuando era un joven físico desconocido, empleado en la Oficina de Patentes de Berna, publicó su teoría de la relatividad especial. En ella incorporó, en un marco teórico simple fundamentado en postulados físicos sencillos, conceptos y fenómenos estudiados antes por Henri Poincaré y Hendrik Lorentz. Como una consecuencia lógica de esta teoría, dedujo la ecuación de la física más conocida a nivel popular: la equivalencia masa-energía, E=mc². Ese año, publicó otros trabajos que sentarían algunas de las bases de la física estadística y de la mecánica cuántica.\n",
    "\n",
    "En 1915, presentó la teoría de la relatividad general, en la que reformuló por completo el concepto de la gravedad.[5]​ Una de las consecuencias fue el surgimiento del estudio científico del origen y la evolución del universo por la rama de la física denominada cosmología. En 1919, cuando las observaciones británicas de un eclipse solar acontecido en mayo de ese año, confirmaron sus predicciones acerca de la curvatura de la luz, fue idolatrado por la prensa.[6]​ Einstein se convirtió en un ícono popular de la ciencia mundialmente famoso, un privilegio al alcance de muy pocos científicos.[7]​\n",
    "\n",
    "Por sus explicaciones sobre el efecto fotoeléctrico y sus numerosas contribuciones a la física teórica, en 1921 obtuvo el Premio Nobel de Física y no por la Teoría de la Relatividad, pues el científico a quien se encomendó la tarea de evaluarla no la entendió, y temieron correr el riesgo de que luego se demostrase errónea.[8]​[9]​ En esa época era aún considerada un tanto controvertida.\n",
    "\n",
    "Ante el ascenso del nazismo, Einstein abandonó Alemania en diciembre de 1932 con destino a Estados Unidos, donde se dedicó a la docencia en el Institute for Advanced Study. Se nacionalizó estadounidense en 1940. Durante sus últimos años trabajó por integrar en una misma teoría la fuerza gravitatoria y la electromagnética.\n",
    "\n",
    "Aunque es considerado por algunos como el «padre de la bomba atómica», abogó por el federalismo mundial, el internacionalismo, el pacifismo, el sionismo y el socialismo democrático, con una fuerte devoción por la libertad individual y la libertad de expresión.[10]​[11]​[12]​[13]​ Fue proclamado «personaje del siglo XX» y el más preeminente científico por la revista Time.[14]​\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "98ba2d04",
   "metadata": {},
   "outputs": [],
   "source": [
    "documents = [Document(page_content=text)]\n",
    "graph_documents = await graph_transformer.aconvert_to_graph_documents(documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "39ea8913",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[GraphDocument(nodes=[Node(id='Albert Einstein', type='Person', properties={}), Node(id='Ulm', type='City', properties={}), Node(id='Imperio Alemán', type='Country', properties={}), Node(id='14 De Marzo De 1879', type='Date', properties={}), Node(id='Princeton', type='City', properties={}), Node(id='Estados Unidos', type='Country', properties={}), Node(id='18 De Abril De 1955', type='Date', properties={}), Node(id='Físico', type='Profession', properties={}), Node(id='Alemán', type='Nationality', properties={}), Node(id='Judío', type='Religion', properties={}), Node(id='Suizo', type='Nationality', properties={}), Node(id='Austriaco', type='Nationality', properties={}), Node(id='Siglo Xx', type='Time period', properties={}), Node(id='Henri Poincaré', type='Person', properties={}), Node(id='Hendrik Lorentz', type='Person', properties={}), Node(id='E=Mc²', type='Equation', properties={}), Node(id='1915', type='Date', properties={}), Node(id='Relatividad General', type='Theory', properties={}), Node(id='Gravedad', type='Concept', properties={}), Node(id='Cosmología', type='Field', properties={}), Node(id='1919', type='Date', properties={}), Node(id='Premio Nobel De Física', type='Award', properties={}), Node(id='Efecto Fotoeléctrico', type='Phenomenon', properties={}), Node(id='Alemania', type='Country', properties={}), Node(id='Diciembre De 1932', type='Date', properties={}), Node(id='Institute For Advanced Study', type='Institution', properties={}), Node(id='1940', type='Date', properties={}), Node(id='Fuerza Gravitatoria', type='Force', properties={}), Node(id='Fuerza Electromagnética', type='Force', properties={}), Node(id='Time', type='Publication', properties={})], relationships=[Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Ulm', type='City', properties={}), type='BORN_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Imperio Alemán', type='Country', properties={}), type='BORN_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='14 De Marzo De 1879', type='Date', properties={}), type='BIRTH_DATE', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Princeton', type='City', properties={}), type='DIED_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Estados Unidos', type='Country', properties={}), type='DIED_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='18 De Abril De 1955', type='Date', properties={}), type='DEATH_DATE', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Físico', type='Profession', properties={}), type='OCCUPATION', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Alemán', type='Nationality', properties={}), type='NATIONALITY', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Judío', type='Religion', properties={}), type='RELIGION', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Suizo', type='Nationality', properties={}), type='NATIONALITY', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Austriaco', type='Nationality', properties={}), type='NATIONALITY', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Siglo Xx', type='Time period', properties={}), type='LIVED_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Henri Poincaré', type='Person', properties={}), type='INFLUENCED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Hendrik Lorentz', type='Person', properties={}), type='INFLUENCED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='E=Mc²', type='Equation', properties={}), type='DEVELOPED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='1915', type='Date', properties={}), type='DEVELOPED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Relatividad General', type='Theory', properties={}), type='DEVELOPED', properties={}), Relationship(source=Node(id='Relatividad General', type='Theory', properties={}), target=Node(id='Gravedad', type='Concept', properties={}), type='EXPLAINS', properties={}), Relationship(source=Node(id='Relatividad General', type='Theory', properties={}), target=Node(id='Cosmología', type='Field', properties={}), type='LED_TO', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='1919', type='Date', properties={}), type='FAMOUS_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Premio Nobel De Física', type='Award', properties={}), type='RECEIVED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Efecto Fotoeléctrico', type='Phenomenon', properties={}), type='RESEARCHED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Alemania', type='Country', properties={}), type='LIVED_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Diciembre De 1932', type='Date', properties={}), type='LIVED_IN', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Institute For Advanced Study', type='Institution', properties={}), type='WORKED_AT', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='1940', type='Date', properties={}), type='NATIONALIZED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Fuerza Gravitatoria', type='Force', properties={}), type='RESEARCHED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Fuerza Electromagnética', type='Force', properties={}), type='RESEARCHED', properties={}), Relationship(source=Node(id='Albert Einstein', type='Person', properties={}), target=Node(id='Time', type='Publication', properties={}), type='FEATURED_IN', properties={})], source=Document(metadata={}, page_content='\\nAlbert Einstein pronunciación en alemán: /ˈalbɐt ˈaɪnʃtaɪn/ (escucharⓘ);[2]\\u200b (Ulm, Imperio alemán, 14 de marzo de 1879-Princeton, Estados Unidos, 18 de abril de 1955) fue un físico alemán de origen judío, nacionalizado después suizo, austriaco y estadounidense. Se le considera el científico más importante, conocido y popular del siglo XX.[3]\\u200b[4]\\u200b\\n\\nEn 1905, cuando era un joven físico desconocido, empleado en la Oficina de Patentes de Berna, publicó su teoría de la relatividad especial. En ella incorporó, en un marco teórico simple fundamentado en postulados físicos sencillos, conceptos y fenómenos estudiados antes por Henri Poincaré y Hendrik Lorentz. Como una consecuencia lógica de esta teoría, dedujo la ecuación de la física más conocida a nivel popular: la equivalencia masa-energía, E=mc². Ese año, publicó otros trabajos que sentarían algunas de las bases de la física estadística y de la mecánica cuántica.\\n\\nEn 1915, presentó la teoría de la relatividad general, en la que reformuló por completo el concepto de la gravedad.[5]\\u200b Una de las consecuencias fue el surgimiento del estudio científico del origen y la evolución del universo por la rama de la física denominada cosmología. En 1919, cuando las observaciones británicas de un eclipse solar acontecido en mayo de ese año, confirmaron sus predicciones acerca de la curvatura de la luz, fue idolatrado por la prensa.[6]\\u200b Einstein se convirtió en un ícono popular de la ciencia mundialmente famoso, un privilegio al alcance de muy pocos científicos.[7]\\u200b\\n\\nPor sus explicaciones sobre el efecto fotoeléctrico y sus numerosas contribuciones a la física teórica, en 1921 obtuvo el Premio Nobel de Física y no por la Teoría de la Relatividad, pues el científico a quien se encomendó la tarea de evaluarla no la entendió, y temieron correr el riesgo de que luego se demostrase errónea.[8]\\u200b[9]\\u200b En esa época era aún considerada un tanto controvertida.\\n\\nAnte el ascenso del nazismo, Einstein abandonó Alemania en diciembre de 1932 con destino a Estados Unidos, donde se dedicó a la docencia en el Institute for Advanced Study. Se nacionalizó estadounidense en 1940. Durante sus últimos años trabajó por integrar en una misma teoría la fuerza gravitatoria y la electromagnética.\\n\\nAunque es considerado por algunos como el «padre de la bomba atómica», abogó por el federalismo mundial, el internacionalismo, el pacifismo, el sionismo y el socialismo democrático, con una fuerte devoción por la libertad individual y la libertad de expresión.[10]\\u200b[11]\\u200b[12]\\u200b[13]\\u200b Fue proclamado «personaje del siglo XX» y el más preeminente científico por la revista Time.[14]\\u200b\\n\\n'))]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "30fd7e8c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_neo4j import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "8c738371",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=neo4j_uri, \n",
    "    username=neo4j_user, \n",
    "    password=neo4j_password, \n",
    "\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "b2018111",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.add_graph_documents(\n",
    "    graph_documents, \n",
    "    baseEntityLabel=True,\n",
    "    include_source=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "e863be81",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.refresh_schema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a664b188",
   "metadata": {},
   "outputs": [],
   "source": [
    "schema = \"\"\"\n",
    "Node properties:\n",
    "- Entity {name: STRING}\n",
    "Relationship types:\n",
    "- RELATED_TO\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "2723ce36",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person {name: \"Albert Einstein\"})-[:BIRTH_DATE]->(d:Date)\n",
      "RETURN d.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'d.name': '14 De Marzo De 1879'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n"
     ]
    }
   ],
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm=llm, \n",
    "    graph=graph, \n",
    "    verbose=True,\n",
    "    allow_dangerous_requests=True, # Required in recent versions to acknowledge Cypher execution\n",
    ")\n",
    "\n",
    "response = chain.invoke({\"query\": \"What year was born Albert Einstein?\"})\n",
    "print(response[\"result\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "052e39c4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts.prompt import PromptTemplate\n",
    "\n",
    "# Create a prompt that forces the LLM to use the provided context\n",
    "CYPHER_QA_TEMPLATE = \"\"\"You are an assistant that helps form friendly responses.\n",
    "The following is the result of a database query:\n",
    "{context}\n",
    "\n",
    "Original Question: {question}\n",
    "\n",
    "Please provide a natural language answer based ONLY on the query result provided above. \n",
    "If the result is empty, say you don't know.\n",
    "\"\"\"\n",
    "\n",
    "qa_prompt = PromptTemplate(\n",
    "    input_variables=[\"context\", \"question\"], \n",
    "    template=CYPHER_QA_TEMPLATE\n",
    ")\n",
    "\n",
    "# Pass this into your chain\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm=llm,\n",
    "    graph=graph,\n",
    "    qa_prompt=qa_prompt, # This fixes the \"I don't know\" issue\n",
    "    allow_dangerous_requests=True,\n",
    "    verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "31274c66",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Person {name: \"Albert Einstein\"})-[:FAMOUS_IN]->(d:Date)\n",
      "RETURN d.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'d.name': '1919'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Based on the information I have, Albert Einstein is famous because his name is \"1919\".\n"
     ]
    }
   ],
   "source": [
    "response = chain.invoke({\"query\": \"Why is Albert Einstein invent?\"})\n",
    "print(response[\"result\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "ed3a1c68",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n) \n",
    "SET n.name = n.id\n",
    "\"\"\"\n",
    "results = graph.query(query)\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2373d100",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Goal of next day: \n",
    "\n",
    "# Read and understand the schema behind light RAG\n",
    "# Decide the different steps you want to takeGitHub Copilot: Sign in\n",
    "# Implement the steps. \n",
    "\n",
    "\n",
    "# It is really important that you really dig into the planning step. Do not rush, understand everything and stick to the decided idea. "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "kg-augmented-multimodal-rag (3.12.12)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
